backend/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        comment = Comment.find_by_id(params[:id])

INSERT INTO "comments" ("summary", "drink_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["summary", "test"], ["drink_id", 1], ["created_at", "2021-01-31 00:53:14.645885"], ["updated_at", "2021-01-31 00:53:14.645885"]]
---
    def create
        comment = Comment.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        comment = Comment.find_by_id(params[:id])
        if !comment
          render json: { error: "No comment by that ID", status: 400 }, status: 400
        else
          comment.destroy