backend/app/controllers/drinks_controller.rb

    def show
        drink = Drink.find_by_id(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        drink = Drink.create(drink_params)
---
INSERT INTO "drinks" ("name", "caffeine", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Wooden Chair"], ["caffeine", "12"], ["created_at", "2021-01-31 01:40:36.323475"], ["updated_at", "2021-01-31 01:40:36.323475"]]

    def destroy
        @drink.destroy
---
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]

    def set_drink
        @drink = Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]